app/controllers/school_classes_controller.rb

  def update
    @school_class = find_school_class
    @school_class.update(school_class_params)
---
UPDATE "school_classes" SET "title" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "History"], ["updated_at", "2018-06-15 00:13:51.744169"], ["id", 4]]